# CannotRotateLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LoadFailures..::..CannotRotateLoad Property
BuiltInFailures..::..LoadFailures Class See Also
---
Can't rotate Load because rotation axis is not perpendicular to sketch plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotRotateLoad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotRotateLoad As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotRotateLoad {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LoadFailures Class
Autodesk.Revit.DB Namespace